This family instance was hosted by a curved face that is no longer present in the linked file. To move the family instance, rehost it.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId FrozenBecauseFaceGone { get; }
  Visual Basic
Public Shared ReadOnly Property FrozenBecauseFaceGone As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ FrozenBecauseFaceGone {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures FamilyFailures Class
  Autodesk.Revit.DB Namespace